Layer (type)                Output Shape              Param #
================================================================
CNNBackbone                 [64, 128]                 82,944
================================================================
Total params: 82,944
