Layer (type)                Output Shape              Param #
================================================================
Linear-1                    [64, 32]                  4,128
ReLU                        [64, 32]                  -
Linear-2                    [64, 10]                  330
================================================================
Total params: 4,458
